-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2018-05-25 16:41:19
-- 服务器版本： 10.1.16-MariaDB
-- PHP Version: 5.5.38

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `promotion`
--

-- --------------------------------------------------------

--
-- 表的结构 `p_admin`
--

CREATE TABLE `p_admin` (
  `id` int(11) NOT NULL,
  `uname` varchar(50) NOT NULL COMMENT '用户名',
  `pword` varchar(200) NOT NULL COMMENT '密码',
  `identifiers` varchar(200) NOT NULL COMMENT '唯一标识符',
  `createtime` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `lastlogintime` int(11) NOT NULL DEFAULT '0' COMMENT '上一次登录时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='管理员';

--
-- 转存表中的数据 `p_admin`
--

INSERT INTO `p_admin` (`id`, `uname`, `pword`, `identifiers`, `createtime`, `lastlogintime`) VALUES
(1, 'hahaha', '46f94c8de14fb36680850768ff1b7f2a', '4e9ef2a9e808ce69677053025f179724', 1485248838, 1527237503);

-- --------------------------------------------------------

--
-- 表的结构 `p_big_category`
--

CREATE TABLE `p_big_category` (
  `id` int(11) NOT NULL,
  `catename` varchar(100) NOT NULL COMMENT '大分类名称',
  `tname` varchar(50) NOT NULL COMMENT '表名'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='大分类';

--
-- 转存表中的数据 `p_big_category`
--

INSERT INTO `p_big_category` (`id`, `catename`, `tname`) VALUES
(1, '产品展示', 'products'),
(2, '新闻中心', 'news'),
(14, '首页数据列表', 'index_data');

-- --------------------------------------------------------

--
-- 表的结构 `p_contact`
--

CREATE TABLE `p_contact` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL COMMENT '姓名',
  `email` varchar(100) NOT NULL COMMENT '邮箱',
  `telephone` varchar(100) NOT NULL COMMENT '电话',
  `content` text NOT NULL COMMENT '留言内容',
  `ip` varchar(100) NOT NULL COMMENT '客户IP',
  `createtime` datetime NOT NULL COMMENT '留言时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='联系我们';

--
-- 转存表中的数据 `p_contact`
--

INSERT INTO `p_contact` (`id`, `name`, `email`, `telephone`, `content`, `ip`, `createtime`) VALUES
(1, 'tom', 'tom163@gmail.com', '15233069857', 'tom\r\ntom163@gmail.com\r\n15233069857', '127.0.0.1', '2018-05-23 12:38:30'),
(2, 'harry', 'harry122@gmail.com', '15366987120', 'harry\r\nharry122@gmail.com\r\n15366987120', '127.0.0.1', '2018-05-23 14:40:52'),
(3, '张三', 'zhangsan@163.com', '12033658751', '张三\r\nzhangsan@163.com\r\n12033658751', '127.0.0.1', '2018-05-24 17:09:04'),
(4, '张三', 'zhangsan@163.com', '12033658751', '张三\r\nzhangsan@163.com\r\n12033658751', '127.0.0.1', '2018-05-24 17:10:09'),
(5, '张三', 'zhangsan@163.com', '12033658751', '张三\r\nzhangsan@163.com\r\n12033658751', '127.0.0.1', '2018-05-24 17:12:34'),
(6, '王五', 'wangwu@gmail.com', '1036857210', '王五\r\nwangwu@gmail.com\r\n1036857210', '127.0.0.1', '2018-05-24 17:21:00'),
(7, '赵六', 'zhangliu@gmail.com', '698572112', '赵六\r\nzhangliu@gmail.com\r\n698572112', '127.0.0.1', '2018-05-24 17:22:18'),
(8, '赵八', 'zhaoba@gmail.com', '12022587169', '赵八\r\nzhaoba@gmail.com\r\n12022587169', '127.0.0.1', '2018-05-25 11:03:00'),
(9, '孙九', 'sunjiu@gmail.com', '13698572105', '孙九\r\nsunjiu@gmail.com\r\n13698572105', '127.0.0.1', '2018-05-25 11:20:27'),
(10, '钱山', 'qiansang@gmail.com', '15233698751', '钱山\r\nqiansang@gmail.com\r\n15233698751', '127.0.0.1', '2018-05-25 11:36:42');

-- --------------------------------------------------------

--
-- 表的结构 `p_index_data`
--

CREATE TABLE `p_index_data` (
  `id` int(11) NOT NULL,
  `title` varchar(200) NOT NULL COMMENT '标题',
  `createtime` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updatetime` int(11) NOT NULL DEFAULT '0' COMMENT '更新时间',
  `content` text NOT NULL COMMENT '内容',
  `author` varchar(50) NOT NULL COMMENT '作者'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='首页数据列表';

--
-- 转存表中的数据 `p_index_data`
--

INSERT INTO `p_index_data` (`id`, `title`, `createtime`, `updatetime`, `content`, `author`) VALUES
(1, '第一条', 1527068742, 1527068742, '<h3>我的网站<strong>建站培训班</strong>开始招生</h3>', 'hahaha'),
(2, '第二条', 1527068769, 1527068769, '<h3>专业提供<strong>网站模板，教程培训</strong></h3>', 'hahaha'),
(3, '第三条', 1527068787, 1527068787, '<h3>打造优秀的<strong>建站资源共享学习平台</strong></h3>', 'hahaha');

-- --------------------------------------------------------

--
-- 表的结构 `p_index_data_imgs`
--

CREATE TABLE `p_index_data_imgs` (
  `id` int(11) NOT NULL,
  `pid` int(11) NOT NULL DEFAULT '0' COMMENT '父id',
  `imgname` varchar(100) NOT NULL COMMENT '图片名称'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='首页数据列表图片表';

-- --------------------------------------------------------

--
-- 表的结构 `p_news`
--

CREATE TABLE `p_news` (
  `id` int(11) NOT NULL,
  `title` varchar(200) NOT NULL COMMENT '标题',
  `createtime` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updatetime` int(11) NOT NULL DEFAULT '0' COMMENT '更新时间',
  `content` text NOT NULL COMMENT '内容',
  `author` varchar(50) NOT NULL COMMENT '作者'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='两座城池数据表';

--
-- 转存表中的数据 `p_news`
--

INSERT INTO `p_news` (`id`, `title`, `createtime`, `updatetime`, `content`, `author`) VALUES
(1, '机器人遛机器狗，估计不久能看到了', 1527145557, 1527145557, '<p>根据官方介绍，SpotMini 的正面、背面和侧面均安装有摄像机。在测试之前，机器人先被手动驱动在设置的路线上走过一遍，这是为了让机器人自己创建空间地图。在自主运行期间，SpotMini 使用摄像机的数据将其自身在空间地图中定位，同时检测并避开障碍物。</p>\r\n', 'hahaha'),
(2, '一位90后程序员的自述', 1527145639, 1527145639, '<p>初入职场之时，大多数人都应该考虑过这样的一个问题，如何找到一种实用，简化web流程的方法，在工作之中能有所提升和突破。</p>\r\n\r\n<p><strong>学好哪些？基础必须精通！</strong></p>\r\n\r\n<p>九层之塔，起于垒土;千里之行，始于足下。入门之前，这些都是必不可少的东西，<strong>基础的重要性决定了是在这一行业稳扎稳打还是风雨飘摇。</strong></p>\r\n\r\n<p>掌握HTML +CSS， HTML是网页的核心，是一种制作万维网页面的标准语言，这是前端最基本的知识，相当于小学要学习字母拼音的那种。学好CSS是网页外观的重要一点，CSS可以帮助把网页外观做得更加美观。</p>\r\n\r\n<p>&nbsp; 学好服务器端脚本语言&nbsp; ，服务器端脚本编程也是Web开发人员的基本功之一，Web开发人员需要挑选一个服务器端脚本语言，精通这门基本功。</p>\r\n\r\n<p>学好SQL ，构建动态页面是必须使用到数据库的，但是数据库的产品很多，开发人员遇到这种情况别担心，因为它们都会遵循标准的SQL原则。</p>\r\n\r\n<p>学好JavaScript&nbsp; ，学习JavaScript的基本语法，以及如何使用JavaScript编程将会提高开发人员的个人技能。</p>\r\n\r\n<p>了解Unix和Linux的基本知识，虽然这两点很基础，但是开发人员了解Unix和Linux的基本知识是有益无害的。</p>\r\n\r\n<p>了解Web服务器 ，当你对Apache的基本配置，htaccess配置技巧有一些掌握的话，将来必定受益，而且这方面的知识学起来也相对容易。</p>\r\n\r\n<p>熟悉版本控制系统的用法&nbsp; ，熟悉使用一种优秀的版本控制系统，你在实际工作中就会发现精通一种版本控制系统是很幸福的事情。&nbsp;</p>\r\n\r\n<p>学好Web框架 ，当你掌握了HTML，服务器端脚本语言，CSS和JavaScript后，就应该找一个Web框架加快你的Web开发速度，使用框架可以节约你很多时间，</p>\r\n\r\n<p>框架类的东西太多，就尽量按照自己的需求来，Extjs、prototype、kissy，bootstrap、jQuery UI、easyui、flex、angularJS等等都挺火的，但是你学习了在工作中没有用到的话，也只是充实了一下自己的知识体系而已。</p>\r\n\r\n<p>&nbsp;</p>\r\n', 'hahaha'),
(3, '程序员调查：程序员周末是如何度过的？', 1527145887, 1527145887, '<p>程序员这个行当算是工作比较累的了，而且长时间坐在电脑前码代码，一般身体或多或少都有，身边的很多同事，天天都在说，上班太累，到周末恨不得要睡一天，到周日又郁闷马上要上班了，根本没休息。那么，你的休息时间一般是怎么度过呢？</p>\r\n', 'hahaha'),
(4, '一位工作了10年的程序员总结了这10个血的教训', 1527145997, 1527145997, '<p>1.不要轻易换笔记本电脑，不要跟潮流，不要买过多的电子产品，不要过于频繁的更换手机</p>\r\n\r\n<p>这方面我的经验教训也是惨痛的。我大概前后购买过 5-6 个笔记本，以前的都是 1 万多元一台，最近买的这台 1 万多是给女朋友的，自己买了一台是 7500 元左右，手机大概换过接近 10 个了，这些钱加起来也足够有 10 万以上了。</p>\r\n\r\n<p>平时笔记本啥的贵重物品要保护好，我一个同事不小心丢了 2 台笔记本电脑，接近 2 万的损失啊，你净赚 2 万，不是那么容易的，这个窟窿不是开玩笑的，我曾经也被人偷了一个崭新的笔记本，损失 1.5 万左右，更糟糕的是最新的代码也跟着被偷了。</p>\r\n', 'hahaha'),
(5, '这次是真的？！iPhone SE 2性能堪比iPhone 7！还少了这个东西', 1527146396, 1527146396, '<p>并且它还<strong>支持 HEIF 图像格式和 HEVC 视频压缩</strong>，同时可以使用基于 NFC 的<strong> Apple Pay</strong>，此外还会改用<strong>玻璃后盖</strong>以及支持<strong>无线充电功能</strong>。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>而且！在iPhone SE 2上，<strong>你可能看不到它了&mdash;&mdash;3.5mm耳机接口</strong>！</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>如果真的是这样设计的话，目前在售的有耳机孔的苹果手机可能就只有 iPhone 6s 系列和 iPhone SE了（iPhone SE和iPhone 6s系列：我觉得被针对了...）</p>\r\n', 'hahaha');

-- --------------------------------------------------------

--
-- 表的结构 `p_news_imgs`
--

CREATE TABLE `p_news_imgs` (
  `id` int(11) NOT NULL,
  `pid` int(11) NOT NULL DEFAULT '0' COMMENT '父id',
  `imgname` varchar(100) NOT NULL COMMENT '图片名称'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='图片表';

--
-- 转存表中的数据 `p_news_imgs`
--

INSERT INTO `p_news_imgs` (`id`, `pid`, `imgname`) VALUES
(1, 1, '30325ba25b837be4ea354.jpg'),
(2, 2, 'c1521f6ea06994dae6771.jpg'),
(3, 3, '5e640b989b57154cd4623.jpg'),
(4, 4, 'ca47737a7c4135985d414.jpg'),
(5, 5, '71208c475f731fe0e9399.jpg');

-- --------------------------------------------------------

--
-- 表的结构 `p_products`
--

CREATE TABLE `p_products` (
  `id` int(11) NOT NULL,
  `title` varchar(200) NOT NULL COMMENT '标题',
  `createtime` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updatetime` int(11) NOT NULL DEFAULT '0' COMMENT '更新时间',
  `content` text NOT NULL COMMENT '内容',
  `author` varchar(50) NOT NULL COMMENT '作者'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='河流数据表';

--
-- 转存表中的数据 `p_products`
--

INSERT INTO `p_products` (`id`, `title`, `createtime`, `updatetime`, `content`, `author`) VALUES
(1, '原野里的河川，美不胜收', 1483517258, 1527128289, '', 'hahaha'),
(2, '一望无尽的河流，真是让人欣心悦目', 1483517787, 1527128306, '', 'hahaha'),
(3, '河流湖水，静静欣赏', 1483517947, 1527128330, '', 'hahaha'),
(4, '运河里有悠然的流水、浅绿的水色、如绢的波光', 1485140007, 1527128342, '', 'hahaha'),
(5, '一条河流，像一束丝绒似的在阳光下灿然闪烁，在两岸赤杨和柳树之间，飞星溅沫。逶迤穿过盆地', 1485140036, 1527128352, '', 'hahaha'),
(6, '盈盈一水．柔情依依，清波碧浪，婉转萦回', 1485140062, 1527128363, '', 'hahaha'),
(7, '滹沱河从太行山上流下来。像一匹烈性的马，在峡谷里，腾空飞蹿', 1485140085, 1485140085, '', 'hahaha'),
(8, '光亮的小河，像一条狭径，在起伏不平的田野上面蜿蜒着', 1485140109, 1485140109, '', 'hahaha'),
(9, '一条白丝带似的河水。蜷曲在绿色的草原上', 1485140133, 1485140133, '', 'hahaha'),
(10, '河水静悄悄地流淌，闪动着粼粼的水光，就好似闪动着明亮的眼波，凝视着这秋天山野的秀色', 1485140151, 1485140151, '', 'hahaha'),
(11, '墨黑的河水在月光下流泻着，银光闪烁，迷蒙得像在梦中', 1485140166, 1485140166, '', 'hahaha'),
(12, '河里没有多少水，可是长着不少的绿藻，像油腻的长绿的带子，窄长，深绿，发出些微腥的潮味', 1485140182, 1485140182, '', 'hahaha'),
(13, '这条河像嵌在绿色帐幔间的一根银弦，淙淙流淌，欢快跳跃，滋润着萋萋芳草，催开了簇簇鲜花', 1485140199, 1485140199, '', 'hahaha'),
(14, '黄河有如无数巨龙扭在一起飞旋而下，在窄窄两山之间，咆哮奔腾，冲起的雪白浪头竟比岸上的山头还高', 1485140217, 1527128442, '', 'hahaha'),
(15, '深棕色的河水在两山夹缝中奔突咆哮，旋转直下．訇然作响，虽物换星移，经久不衰', 1485140234, 1527128450, '', 'hahaha'),
(16, '船后面，汩汩地流着像焦油一样浓重，像绸缎一样光滑的一望无际的河水', 1485140257, 1527128457, '', 'hahaha'),
(17, '河水静静流着，波纹粼粼，望过去觉得又快又凉', 1485140272, 1527128464, '', 'hahaha'),
(18, '河上长满白色的百合花和睡莲。仿佛绿毯上绣的纯洁的花', 1485140289, 1527128472, '', 'hahaha'),
(19, '浪涛一个跟着一个，雪崩似地重叠起来．卷起了巨大的漩涡，狂怒地冲击着堤岸，发出哗哗的响声', 1485140318, 1485140318, '', 'hahaha'),
(20, '美丽的河水辉煌地袒露出银色的胸膛', 1485140338, 1485140338, '', 'hahaha'),
(21, '这条河像一个任性的女孩子，无穷尽地耍脾气，每年都要改变环境，选取新的河道', 1485140355, 1485140355, '', 'hahaha'),
(22, '这是一条没有航标的河流，因此而显出一种单纯的、质朴的、天然的美，恰如山区不加装饰的女子', 1485140372, 1485140372, '', 'hahaha'),
(23, '目力所及，只见洪水滔滔，浊浪排空，却不能望见北岸', 1485140390, 1485140390, '', 'hahaha'),
(24, '水流湍激，颇有放纵不羁之概', 1485140407, 1485140407, '', 'hahaha'),
(25, '水是绿油油的，来往的船只不多，镜子一样的水面上这里那里起了几道皱纹或是小小的涡旋', 1485140424, 1485140424, '', 'hahaha'),
(26, '这条河在群山间盘绕纠曲、百转千回在太阳的照耀下．鳞波闪闪', 1485140439, 1485140439, '', 'hahaha'),
(27, '一条条河又纵横交错，流水潺潺，深不过膝', 1485140459, 1485140459, '', 'hahaha'),
(28, '河水像一条青色的筋脉．在河床里弯弯曲曲，转折起伏．张翁搏动', 1485140475, 1485140475, '', 'hahaha'),
(51, '当树叶落尽的时候', 1495186964, 1527128418, '<p>当树叶落尽的时候</p>\r\n\r\n<p>秋风已经老去</p>\r\n\r\n<p>当雪花烂漫的时候</p>\r\n\r\n<p>心灵便有了期待</p>\r\n\r\n<p>当河流安静的时候</p>\r\n\r\n<p>爱会从容地到来</p>\r\n\r\n<p><br />\r\n我期待着那一天</p>\r\n\r\n<p>等待河流安静下来</p>\r\n\r\n<p>到那时</p>\r\n\r\n<p>曾经的忧伤已不在</p>\r\n\r\n<p>忧郁的心结已打开美文</p>\r\n\r\n<p>曾经的无奈终变为承载</p>\r\n\r\n<p>让迟来的爱更精釆</p>\r\n\r\n<p><br />\r\n我等到了，她做到了</p>\r\n\r\n<p>她彻底地安静下来</p>\r\n\r\n<p>河面上出现了路</p>\r\n\r\n<p>相隔已久的心从此沟通往来</p>\r\n\r\n<p>让沉寂的心拥有了情怀</p>\r\n\r\n<p>让爱充满了浪漫的色彩</p>\r\n\r\n<p>那都是雪的安抚</p>\r\n\r\n<p>带来了纯洁的爱</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>当树叶落尽的时候</p>\r\n\r\n<p>秋风已经老去</p>\r\n\r\n<p>当雪花烂漫的时候</p>\r\n\r\n<p>心灵便有了期待</p>\r\n\r\n<p>当河流安静的时候</p>\r\n\r\n<p>爱会从容地到来</p>\r\n\r\n<p><br />\r\n我期待着那一天</p>\r\n\r\n<p>等待河流安静下来</p>\r\n\r\n<p>到那时</p>\r\n\r\n<p>曾经的忧伤已不在</p>\r\n\r\n<p>忧郁的心结已打开美文</p>\r\n\r\n<p>曾经的无奈终变为承载</p>\r\n\r\n<p>让迟来的爱更精釆</p>\r\n\r\n<p><br />\r\n我等到了，她做到了</p>\r\n\r\n<p>她彻底地安静下来</p>\r\n\r\n<p>河面上出现了路</p>\r\n\r\n<p>相隔已久的心从此沟通往来</p>\r\n\r\n<p>让沉寂的心拥有了情怀</p>\r\n\r\n<p>让爱充满了浪漫的色彩</p>\r\n\r\n<p>那都是雪的安抚</p>\r\n\r\n<p>带来了纯洁的爱</p>\r\n', 'hahaha'),
(52, '我是一条奔腾的河流', 1495187063, 1527128408, '<p>我是一条奔腾的河流</p>\r\n\r\n<p>走自己的路</p>\r\n\r\n<p>是我人生梦想的追求</p>\r\n\r\n<p>向前、向前、向前</p>\r\n\r\n<p>执着是我快乐的感受</p>\r\n\r\n<p><br />\r\n我是一条奔腾的河流</p>\r\n\r\n<p>艰辛与坎坷</p>\r\n\r\n<p>阻挡不了我前行的脚步</p>\r\n\r\n<p>奔流、奔流、奔流</p>\r\n\r\n<p>奋勇向前才会去拥有</p>\r\n\r\n<p><br />\r\n我是一条奔腾的河流</p>\r\n\r\n<p>沿途的风景</p>\r\n\r\n<p>永远吸引不了我</p>\r\n\r\n<p>流淌、流淌、流淌</p>\r\n\r\n<p>勇敢追逐是我实现梦想的情愁</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>我是一条奔腾的河流</p>\r\n\r\n<p>走自己的路</p>\r\n\r\n<p>是我人生梦想的追求</p>\r\n\r\n<p>向前、向前、向前</p>\r\n\r\n<p>执着是我快乐的感受</p>\r\n\r\n<p><br />\r\n我是一条奔腾的河流</p>\r\n\r\n<p>艰辛与坎坷</p>\r\n\r\n<p>阻挡不了我前行的脚步</p>\r\n\r\n<p>奔流、奔流、奔流</p>\r\n\r\n<p>奋勇向前才会去拥有</p>\r\n\r\n<p><br />\r\n我是一条奔腾的河流</p>\r\n\r\n<p>沿途的风景</p>\r\n\r\n<p>永远吸引不了我</p>\r\n\r\n<p>流淌、流淌、流淌</p>\r\n\r\n<p>勇敢追逐是我实现梦想的情愁</p>\r\n', 'hahaha'),
(53, '家乡的河', 1495187278, 1527128396, '<p>家乡地处苏北大平原的南部，南临长江，东濒黄海，那里河网密布，人称水乡。</p>\r\n\r\n<p>过去，散落在田野里的村庄大都被大大小小的河流分隔成一座座孤岛，船是唯一的交通工具，几乎家家都有一条木船。这里的孩子们七八岁就能很轻松地游过一条大河，十多岁就学会了撑船。</p>\r\n\r\n<p>宽度达到四五十米的大河多呈东西走向，听老一辈人说，那些河都是被洪水反复冲刷而成的自然河。我们庄子北边就有一条叫&ldquo;车路河&rdquo;的大河，据说很早以前曾是一条大路。那时黄海边上遍布着用海水煮盐的&ldquo;场&rdquo;、&ldquo;灶&rdquo;，煮出来的盐大都用人力小车向内地运送。后来漫天遍野的洪水由西向东奔向大海，这片数百平方公里的湿地上又长满了芦苇，那条大路就成了便捷的行洪通道，久而久之，就被冲刷成一条大河。南边不远的地方还有一条叫&ldquo;蚌蜒河&rdquo;的大河，那条河弯弯曲曲的，就像是河蚌在湿地上蜿蜒爬行的轨迹，据说也是古代洪水留下的&ldquo;杰作&rdquo;。</p>\r\n\r\n<p>与大河相连的那些密如蛛网般的小河，还有庄子周边的那些沟沟汊汊大都是我们的祖先用人工开挖出来的，当初，他们为了在这片低洼的湿地上垒起一块能搭建房舍的高地，只能就近挖河取土。还有，种植庄稼的土地也要尽可能地垫得高一些，才能避免被频繁的洪水淹没，他们唯一能采用的办法就是将周边洼地开挖成一条条小河。年代久了，耕地越来越高，小河也越来越宽越深，内下河地区的独特的地貌就在一代又一代人的接力中形成了。</p>\r\n\r\n<p>家乡美，美就美在家乡水，依稀记得小时候，大河上白帆点点，小河边杨柳依依。每至傍晚，夕阳染红了西天，河面上波光粼粼，树木葱笼的村庄上空飘着袅袅炊烟。那时还不曾农业合作化，下田干农活的人们都撑着自家的小船收工了，男人将船撑到自家门前，坐在船头上的女人拿起桩绳轻快地跳上岸，将桩绳系到河边的树干上，此时他们的几个孩子总会在河边雀跃着迎接他们归来。</p>\r\n\r\n<p>那时，家乡的河清澈见底，站在河岸上，能看到鱼儿在水草丛中悠闲地嬉戏。河里的水，可称得上是真正的原生态，生活在这里的人，世世代代都将河水当着一个天然的大水缸，在田里干活时口渴了，到河边上捧一捧河水，那种甜滋滋的清凉立即沁入脾胃，让人顿觉神清气爽。到了夏天，庄子周边的河就成了天然大浴场，孩子们成天乐此不疲地在河里疯玩。每至傍晚，大人们也会聚集到那里去洗去一身疲惫。最让人难以忘怀的是田野里的那种野趣，那时离庄子较远的地方大都还有些成片的尚未开发利用的处女地，那里的陆地上长着茂密的芦苇，河面上不时会冒出一群野鸭子，有时它们还会扑楞着翅膀飞上蓝天。运气好的时候，钻行在芦苇丛中还能在不经意间踩到一只大甲鱼。</p>\r\n\r\n<p>还记得，在上世纪六七十年代，为了发展集体经济，摆脱饥饿和贫困，不知道从那儿引进过来一批叫&ldquo;三水&rdquo;的水生植物，从此，家乡的河道里便一天天地变得面目全非了。&ldquo;三水&rdquo;就是水葫莲、水花生和绿萍。其中水葫莲和绿萍原本是想利用其作农田的肥料，水花生是用来作养猪的青饲料，不曾想到后来事与愿违，千方百计地繁殖起来的肥料并没能增产多少粮食，因为那种水生植物根本就不肥，水花生倒是在那时的集体猪场里喂过好几年猪，后来发现用其作青饲料喂猪，只能保命，既不增重更不增膘，喂的那些&ldquo;长寿猪&rdquo;个个瘦骨嶙峋的，白白地浪费了精料和人工，没一点经济效益。不过，那时繁育&ldquo;三水&rdquo;、发展生猪养殖可是一项政治任务，虽然集体猪场年年亏本，但还是一直坚持到人民公社解体。</p>\r\n\r\n<p>俗话说：请神容易退神难。分田到户后，没人再去刻意繁殖的那些外来物种却恣意地在河道中自行漫延开来。其中繁殖特别快的是水花生，它不但能在小河里长得密密匝匝，在陆地上也能长得很茂盛，每至秋天，小河里连船都撑不进，不得不花许多人工去清理河道。听说，水花生是从日本引进的，想到当年那么多凶残的鬼子兵都被我们打跑了，现在却对这种祸害水体的物种束手无策。</p>\r\n\r\n<p>后来改革开放了，中国的经济发展步入了快车道，各种污染源让家乡的河更加不堪重负。几十年来，它接纳了形形色色的工业废水和大量化肥农药的残留，还有随便倾倒的生活垃圾。现在看来，污染河水的主要因素还不光是工业废水，更严重的是由于现代农业滥用了大量化肥、农药。据说中国化肥、农药产量早就超过了美国，中国人用掉了全世界的三分之一以上的化肥、农药!是世界单位面积平均用量的2。5&mdash;5倍!结果是不但污染了土地和河流，而且造成了食品安全的隐患，影响了国人的健康。</p>\r\n\r\n<p>还有，现在农村中的生活垃圾好像也与时俱进今非昔比了。过去，农村里没有多少一点用处都没有的废弃物，就是有点儿烂菜叶、碎草屑之类的东西，他们都会倒在自家的灰堆塘里留着作肥料，那时候，粮食不够吃，家家还都养着一头猪，厨房里的泔水都是喂猪的好饲料，更谈不上有剩饭剩菜随处乱倒，就连馊得起了泡沫的粥也要加点碱热了再喝掉。现在情况不同了，物质丰富了，他们都有吃不完的粮食，每天都会有一些厨房垃圾要往河里倒。过去他们上街买菜都要挎上一个竹篮子，现在都用方便袋，于是，弄得河面上随处可见五颜六色的洋垃圾。还有，以前的农村人都用谷草作为燃料，现在再也没人烧那种烟熏火燎的土灶了，大量的作物秸杆不是就地焚烧污染空气，就是推至河里烂掉污染水源。现在，河里的水早就不能饮用了，庄户人家都吃上了自来水。这项改革，看起来好像是一种进步，其实，他们那里知道用如今的河水净化成的自来水怎么能比得上当年的原生态?</p>\r\n\r\n<p>但愿我们的国家，到了经济上圆了&ldquo;中国梦&rdquo;的那一天，不要毁掉赖以生存的环境。</p>\r\n\r\n<p>救救家乡的河。</p>\r\n', 'hahaha'),
(54, '走进泥峪河', 1495188089, 1527128388, '<p>周六，小城的温度据报将超36度，未来两三天还将持续，手机一大早就陆续接到市、区以及周边县市的气象局的高温预警。这中伏的天真的热了起来!</p>\r\n\r\n<p>前两天接连的白雨也没有把这气温降低，以给期盼着炎炎夏日里清凉的人们带来短暂的清爽，夜里可以睡一个安觉!周三、周四两场倾盆而过且雨后的天空果真如洗，虽说不见往日的瓦蓝色，倒也不负众望那色调还算是蓝色，横亘于空的七彩虹，也带给久违的人们一丝惊喜，网友纷纷在群里、圈里、空间里晒那手机抓拍的景象!</p>\r\n\r\n<p>按老话说，白雨连三场。不过已过去了两天，那第三场还是迟迟不肯露面!也许，这季节里老话也将被逆转?!应该不会的，只是那天空中云彩正在赶路，遇到塞车，可能会晚些时候到!</p>\r\n\r\n<p>这时节，风雨不定，等，可能是等不来了!索性吃罢早餐，径直出门，向南，直接奔向逶迤的秦岭，投入那青山绿水，将夏日炎炎抛在山外，让山风迎面而来，将一切不爽挡在身后。</p>\r\n\r\n<p>以前曾多次走向这每每在艳阳下眺望并向往的群山，也曾经多次走进过东西两边的有名的峪口，可这距离最近的峪口总是没有真正地走进!</p>\r\n\r\n<p>匆匆过河，一路向南，过哑柏，穿越环山路走过竹峪镇，七捌八绕，找到一个峪口，沿途有几辆别处牌照的车子随意停在路边的宽敞处、树荫下。本以为就算是到了，可经打听才知，前面是可以进山，但不是游玩的地方，再往前几乎没有路了!只好捌了出来，沿路问过几位村民，说是西边有泥峪河!再次走过环山路，向西行驶，不远，路边一块泥峪的指示牌，就是这了!</p>\r\n\r\n<p>向南经金盆村，右捌穿过塔庙村，沿着不宽的水泥路曲折前行，便缓缓走进了我们想要去的地方&mdash;&mdash;泥峪。</p>\r\n\r\n<p>道路依山傍河，两旁青山巍峨。正午的艳阳高照于头顶，眼前的翠绿叠加在远山的厚重之上，满目怡人的绿色。车行于山间，如同浮游于绿色的河流。渐行渐深入山中，景色秀丽中透着丝丝清凉，偶尔有斜插于路边的小车，电动车、摩托车三三两两拢在树荫、岩下，主人们早已下到河边，感受涧水的清澈、清凉。</p>\r\n\r\n<p>车子在路上漂行，不经意换到了河的右边，一路忽儿宽敞、忽儿窄小，就这样晃悠于其中，如船只航行别处的溶洞，不知前方的曲折与方向。走过几处临时的烧烤摊、几个山中居民开的饭店，不久让一座窄小的便桥终结了前进的路!前方，没有了可以继续的水泥路，只有那延伸向更深处的便道&hellip;&hellip;</p>\r\n\r\n<p>没有别处那景点人为的痕迹，稍显粗犷，一切入目的景色显得那么静穆、没有一丝张扬。这是还没有开发的地方， 七八辆堆积在桥头不大的地方，近旁汩汩流动的水声衬托出山中的静谧，大山峻峭、阳光明媚、水草丰盛，水边不时传来游人若隐若现的说话声，人被厚重的水草遮挡，只闻其声，不见其人!</p>\r\n\r\n<p>循着水声上行不远，摸索着下河，大大小小亮白的石头半浸在清冽的水中，水面上的部分反射正午灼人的阳光。没有那可以敝日的大树，只好就在水旁寻找暂且歇息之地。</p>\r\n\r\n<p>屈身于不大的树荫下，脚下还显富有裕，几个人委身而坐，算是暂时丢开了路上起伏与飘逸。山中，静谧的山中，这泥峪算是走近了我、我走进了这峪中。亲水而坐、聆水而栖，抬头放目，四周都是那么静默，熠熠生辉的是艳阳高照下的绿色的山岭，蓝色的天空此刻没有一片悠然自得的云朵，也没有那怡人的山风穿越这山间。同是在这夏日伏天的阳光下，置身户外，没有了那山外灼人的躁热。</p>\r\n\r\n<p>身边的流水不知疲倦地汩汩欢唱，一路走来的身心在这静美的山中舒缓。静静地享受山中的清秀、静默中的山色旖旎、淡淡地远观峻岭的默然。离开了喧嚣本身就是一种享受，走进这山水相连的峪中，静美如画，却比那画多了灵气、多了滋润。那画只可近观，意会它的美、揣摩它的意境。如今置身山水间、听水声、观山色，不就是一种触手可及的幸福?!</p>\r\n\r\n<p>水色惹人恋、山光忘人归。久居山外那种种浮躁与浮华总是让人渐生倦意，这山、这水会让你忘却了那山外的一切!也许，那山外的一切于人也似这山中静谧的氛围，是一种不可回避的历练、一种不可意会到的享受!</p>\r\n\r\n<p>此间时日久，莫许不思还。该走了，走向山外的世界，再返夏日炎炎&hellip;&hellip;</p>\r\n', 'hahaha'),
(55, '故乡那条小河', 1495188865, 1527128379, '<p>在我家老屋程家晓湾背后，有一条长流不息的小河。这条小河发源于四川盆地东北部明月山的一个溶洞，绢绢细流穿过两山之间的一峡谷，从悬崖飞流直下，与山脚一煤窑流出的水会合，在浅丘与平坝之间，象一条爬行的长蛇，蜿蜒前行，长流不息。</p>\r\n\r\n<p>小时候，我只看见这条小河从高高的西山上流下来，曲里拐弯，流经我家老屋背后，穿过马峡口，一直向东流去。我一直以为它流到几十里外的冒河寨脚下，汇入卧龙河。近日，我翻阅老家重庆市垫江县的地图，才找到这条小河的流经线路。原来，这条小河穿越马峡口向东流不远，就被一匹绵延不断、形似城墙的丘陵挡住了去路，随即一个直角拐弯，由东向南流去，沿着丘陵走向，经澄溪，过海棠，沿途接纳多条支流，象一条白练平缓绕过云台后，终于找到穿过那匹丘陵的缺口，于是集蓄力量，奔涌而出，流向东南方，汇入龙溪河，流进浩浩荡荡的长寿湖，最后注入滚滚长江。</p>\r\n\r\n<p>虽然它是一条无名小河，但承载着我儿时许多美好的记忆。那是上世纪七十年代，每逢冬腊月农闲时，十来岁的我经常随三姑和堂姐上山割柴。从老屋出门，走上河堤，逆流而上，行至山脚，抬头就望见两山峡谷中流出一股清泉，从一高悬的石崖飞流直下，形成一条细长的瀑布，悬挂在半山腰;沿着蜿蜒的溪流，爬行在崎岖的山道上，&ldquo;哗哗&rdquo;的流水声响彻耳畔，一眼眼碧绿的积水深潭，一条条悬挂的细长瀑布，令人目不暇接!每次上山割柴行走到这里，我都被这幅山水美景吸引，尽管爬山累得气喘吁吁，汗湿衣衫，但每次都激动得大呼小叫，流连忘返!</p>\r\n\r\n<p>早些年，这条发源于西山溶洞的小河，宽不过六米，河水不大，流速不湍急，浅处淹至膝盖，每遇转弯处就有一个积水潭，那一个个水潭水或深过腰，或淹及腿部。由于未受污染，河水清澈见底，一群群小鱼儿在河流中任意穿行，尤其是那一个个积水潭的鱼儿最多。于是，那一个个积水潭便成了小伙伴们夏日戏水消暑的好去处。每逢酷暑难熬的炎炎夏日，我与小伙伴们常常跑到这条小河里疯玩，一个个脱得一丝不挂，跳入水潭里，尽情地享受河水带来的凉快，任由成群结队的鱼儿对肢体的碰撞和抚摸，然后便摸鱼儿、捉螃蟹。每次下河不疯一两个钟头，是决不会上岸的。儿时与小伙伴在小河里戏嬉打闹的情景，深深刻印在我脑海里，不时浮现在眼前，令我留念，难以忘怀。</p>\r\n\r\n<p>还有更让我难以忘怀的野生美味。我妈的一个么舅，是个捕捉甲鱼的能手，只见他时常头戴一顶草帽，身背一帆布袋子，手持一鱼杆，沿着小河来回行走，寻找甲鱼的蛛丝马迹。他每次来都能捕捉到几个野生甲鱼，每次都要送给我家一个，并指导我妈煮一锅味道鲜美的甲鱼汤，让我们兄妹几个美美饱餐一顿。在那个缺粮少油、饥肠咕噜的年月，能吃上野生甲鱼肉，那可是一般人吃不到的美味佳肴啊!每次饱口福后，让我们兄妹几个要回味好长时间，并时常盼望着么舅公再来。我记得，那几年么舅公确实来过几次，每次都给我家送来一个野生甲鱼。几十年过去了，我还念想当年那碗野生甲鱼汤的美味!</p>\r\n\r\n<p>然而，好景不长。上世纪七十年代，在西山脚下，也就是这条小河的上游，已经停产多年的一家县办铁厂恢复生产，还新建了洗煤厂和焦炭厂。从此，这条小河厄运降临。河床被煤渣煤矸石填高，河水由清变黑且昏浊了，生态随之发生了变化，再也看不见清澈见底的河水和鱼翔浅底的美景;螃蟹、甲鱼逃之夭夭，不见了踪影;媳妇姑娘们再也不敢在河边淘菜、洗衣了&hellip;&hellip;</p>\r\n\r\n<p>更可恶的是，每年夏季汛期，一下暴雨，山洪席卷煤渣、煤矸石，直冲而下，冲决了河堤，冲毁了两岸的稻田。尤其是老家在河边的那片稻田，几乎年年遭洪灾，不是被洪水淹没，就是被煤渣煤石填平。每次洪水过后，生产队长就组织全队男女老少，挥锄扬锹，肩挑背扛，挑走泥沙，搬走煤石，修筑河堤，平整稻田。那几年，老家的父老乡亲与洪灾进行了不懈斗争，尽管付出了很多辛劳和汗水，但常常被无情的洪水冲毁，或颗粒无收，或收获甚微。</p>\r\n\r\n<p>时光进入上世纪八十年代后期，西山脚下那铁厂、煤矿相继关闭，这条小河重获新生，河水由黑昏变清澈，生态逐步恢复。特别是后来修筑沪蓉高速公路，穿越明月山的隧道就在这条小河上游的边上。据老屋的长辈讲，在挖掘隧道时，施工队不慎将山脉的阴河挖漏，使这条小河的水流量倍增，而远在20多里以外的县城那段山上的河流、溶洞的水流量却剧减，尤其使县城饮水源之一白龙洞的水急剧下降乃至枯竭，影响到市民的生活用水;穿行环绕县城的桂溪河也因上游来水不足，影响县城滨河景观。情急之下，县政府不得不组织人力沿山脚挖沟修堰，从我老屋背后那条小河引水接济县城，以确保县城桂溪河和正在打造的湿地公园常年水量充沛。于是，每当我在县城滨河步行道上散步，看到那奔流不息的河水，心里就升腾起一种亲近感和自豪感。</p>\r\n\r\n<p>前不久，我回老屋祭祖，特意绕道经过那条小河。小河还是我儿时记忆的模样，河床不宽，两岸河堤略有增高加固。河水清澈透明，流量大且流速快，不时荡起一层层波澜，沾起一朵朵美丽的浪花，&ldquo;哗哗&rdquo;欢快的流水声，不断地敲击我耳畔，似乎在向曾经亲近过它的戏水顽童打招呼，向我这个远道归来的游子诉说它过去几十年跌宕起伏的命运。我走下河堤，双手捧起河水喝了一大口，感觉甘甜清凉，然后捧水洗脸，倍感凉爽惬意。我不由感叹：这一河清水何不充分利用，让它白白流走好可惜啊!正在河边田间劳作的一位隔房堂叔对我说：市县领导曾经来考察过几次，可提取水样经检测，河水含矿物质多，尤其含硫量大，因此人不能饮用，只能用于灌溉。如今已经引走一股河水接济县城，市县有关部门正在想办法充分开发利用这一河水哩!</p>\r\n\r\n<p>听了堂叔的一席话，我感慨万端，沉思良久：没有小溪，哪有河流，没有无数小河流的汇聚，哪有大河大江?家乡的这条无名小河，虽然曾经遭受过污染和生态破坏，但随着生态文明、和谐发展的脚步，使其重获新生。今天，你看它以长流不息的姿态，以无比欢快的流水声音，冲破重重险阻，一路高歌前行，流向大河，注入长江，奔向大海，以它绢绢细流滋润沿河两岸稻谷飘香，以它绵薄之力助推人类繁衍生息和万物生长&hellip;&hellip;</p>\r\n', 'hahaha'),
(56, '程序员都经历过的那些事', 1527144848, 1527144848, '<p>前段时间发现了一篇很有意思的文章，很形象地说明了程序员日常工作中遇到某些事情时的反应。按原作者的话来说，那就是：只要是程序员，看到下面这些表情图都会产生共鸣。</p>\r\n', 'hahaha');

-- --------------------------------------------------------

--
-- 表的结构 `p_products_imgs`
--

CREATE TABLE `p_products_imgs` (
  `id` int(11) NOT NULL,
  `pid` int(11) NOT NULL DEFAULT '0' COMMENT '父id',
  `imgname` varchar(100) NOT NULL COMMENT '图片名称'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='图片表';

--
-- 转存表中的数据 `p_products_imgs`
--

INSERT INTO `p_products_imgs` (`id`, `pid`, `imgname`) VALUES
(1, 1, '4c520ab6cc848dab1b523.jpg'),
(2, 2, 'a35707f262902bab57198.jpg'),
(3, 3, '2f977f735b9320f474577.jpg'),
(4, 4, 'c16953019674720b2d699.jpeg'),
(5, 5, '4c1951db91261e5ba5255.jpeg'),
(6, 6, 'e0316106a869235f90374.jpeg'),
(7, 55, '2d9313aa3a886d20d5345.jpg'),
(8, 54, 'c0779cdcb9388d5d88376.jpg'),
(9, 53, '1e635de79a8658a4fa140.jpg'),
(10, 52, '897482c50f22511cea681.jpg'),
(11, 51, 'af455931c8472e59fe543.jpg'),
(12, 14, '86368f5b6e521d9eac848.jpg'),
(13, 15, '324102532d658caa37844.jpg'),
(14, 16, '6f713d30c23620e899547.jpg'),
(15, 17, '9d19642d1c4567751b515.jpg'),
(16, 18, '6762993274478ca7a1436.jpg'),
(17, 56, 'fe88175596648c0f0b312.jpg');

-- --------------------------------------------------------

--
-- 表的结构 `p_website`
--

CREATE TABLE `p_website` (
  `id` int(11) NOT NULL,
  `keyname` varchar(50) NOT NULL,
  `value` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='网站设置';

--
-- 转存表中的数据 `p_website`
--

INSERT INTO `p_website` (`id`, `keyname`, `value`) VALUES
(1, 'weburl', 'http://www.promotion.com/'),
(2, 'keyword', 'promotion 推广'),
(3, 'descrip', 'promotion 推广 推广'),
(4, 'webname', 'promotion'),
(5, 'webshorturl', 'google.com'),
(6, 'address', '广东省广州市番禺区金城国际大厦ABC'),
(7, 'phone', '+86 186 6688 8899 '),
(8, 'email', 'admin@Baidu.com ');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `p_admin`
--
ALTER TABLE `p_admin`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `p_big_category`
--
ALTER TABLE `p_big_category`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `tname` (`tname`) USING BTREE;

--
-- Indexes for table `p_contact`
--
ALTER TABLE `p_contact`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `p_index_data`
--
ALTER TABLE `p_index_data`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `p_index_data_imgs`
--
ALTER TABLE `p_index_data_imgs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `p_news`
--
ALTER TABLE `p_news`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `p_news_imgs`
--
ALTER TABLE `p_news_imgs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `p_products`
--
ALTER TABLE `p_products`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `p_products_imgs`
--
ALTER TABLE `p_products_imgs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `p_website`
--
ALTER TABLE `p_website`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `p_admin`
--
ALTER TABLE `p_admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- 使用表AUTO_INCREMENT `p_big_category`
--
ALTER TABLE `p_big_category`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
--
-- 使用表AUTO_INCREMENT `p_contact`
--
ALTER TABLE `p_contact`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
--
-- 使用表AUTO_INCREMENT `p_index_data`
--
ALTER TABLE `p_index_data`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- 使用表AUTO_INCREMENT `p_index_data_imgs`
--
ALTER TABLE `p_index_data_imgs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- 使用表AUTO_INCREMENT `p_news`
--
ALTER TABLE `p_news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
--
-- 使用表AUTO_INCREMENT `p_news_imgs`
--
ALTER TABLE `p_news_imgs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
--
-- 使用表AUTO_INCREMENT `p_products`
--
ALTER TABLE `p_products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=57;
--
-- 使用表AUTO_INCREMENT `p_products_imgs`
--
ALTER TABLE `p_products_imgs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;
--
-- 使用表AUTO_INCREMENT `p_website`
--
ALTER TABLE `p_website`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
